---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsReallyFailed
source: html/476ef27c-5eca-ba6c-f177-93ef66de2bf2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsReallyFailed Property

[Room] computations failed. Try to modify the following elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomsReallyFailed { get; }
```